


CODE = 'YOU TOKEN'



text2 = f'''Что позволяет <b>стабильная и адекватная самооценка?</b>

<b>• уйти от синдрома самозванца</b> и реализовать  <b>потенциал</b> без внутренних сомнений в себе и своих возможностях

<b>•</b> твёрдое знание: <b>уже сейчас я достойна  счастья, успеха, высокого дохода, отношений, где я люблю и любима</b>

<b>•</b> свободно и легко <b>вести блог и выражать своё мнение</b> в жизни и в интернете, <b>без оглядки на осуждение или 
критику</b>  коллег, родственников, друзей, хейтеров

<b>•</b> легко <b>знакомиться с людьми и презентовать себя</b> в новом обществе

<b>•</b> жить так, как <b>я хочу,</b> а не как «принято»

<b>•</b> смело устанавливать свои границы <b>без чувства вины и стыда</b>

<b>• принимать и любить себя</b> (от внешности до особенностей характера)

<b>• работать там, где я реализую себя и мне интересно,</b> а не там, где «стабильно, но задолбало»

<b>•</b> а самое главное, это ощущение <b>«МНЕ МОЖНО ВСЁ»</b> и я знаю, как это пойти и взять!'''











































